#+begin_src python :results output
def bubble_sort(inputs):
    n = len(inputs)
    for i in range(n):
        for j in range(n - 1 - i):
            if inputs[j] > inputs[j+1]:
                tmp = inputs[j]
                inputs[j] = inputs[j+1]
                inputs[j+1] = tmp
    return inputs

print(bubble_sort([64, 34, 25, 12, 22, 11, 90]))
#+end_src

#+RESULTS:
: [11, 12, 22, 25, 34, 64, 90]

#+begin_example
[64, 34, 25, 12, 22, 11, 90]
 ^   ^
比较两个标记的数字，交换它们（如果左边的大于右边的）

[34, 64, 25, 12, 22, 11, 90]
     ^   ^
继续比较...

[34, 25, 64, 12, 22, 11, 90]
         ^   ^
...

[34, 25, 12, 64, 22, 11, 90]
             ^   ^
...

[34, 25, 12, 22, 64, 11, 90]
                 ^   ^
...

[34, 25, 12, 22, 11, 64, 90]
                     ^   ^
第一趟排序结束，最大的数字90已经“冒”到了正确的位置。

对于第二趟：

[34, 25, 12, 22, 11, 64, 90]
 ^   ^
...

[25, 34, 12, 22, 11, 64, 90]
     ^   ^
...

[25, 12, 34, 22, 11, 64, 90]
         ^   ^
...
p
[25, 12, 22, 34, 11, 64, 90]
             ^   ^
...

[25, 12, 22, 11, 34, 64, 90]
                 ^   ^
第二趟结束，倒数第二大的数字64已经移动到了正确的位置。

这个过程继续，直到整个列表排好序。

最后的结果是：
[11, 12, 22, 25, 34, 64, 90]

#+end_example
